Revit 2026 API

# DGNFileFormat Enumeration

---

An enumerated type listing available Microstation versions into which a file may be exported.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum DGNFileFormat
```
```vb
Public Enumeration DGNFileFormat
```
```cpp
public enum class DGNFileFormat
```
```fsharp
type DGNFileFormat
```

| Member name | Value | Description |
| --- | --- | --- |
| Default | 20 | The Autodesk Revit application's default file format. |
| DGNVersion7 | 19 | Microstation V7 file format. |
| DGNVersion8 | 20 | Microstation V8 file format. |

#### Reference

Autodesk.Revit.DB Namespace